  const pokeArr = ['무우마', '안농', '마자용','키링키','피콘','쏘콘','노고치','글라이거','강철톤','블루','그랑블루','침바루','핫삼' ,'단단지', '헤라크로스','포푸니','깜지곰','링곰','마그마그','마그카르고'];

  // Todo : Q-1. pokeArr 라는 포켓몬스터 목록이 있다. 목록 데이터에서 '안농' 이라는 포켓몬스터 부터 시작해 다음 다섯개의 포켓몬스터 목록을 추출하는 애플리케이션(코딩)을 만드세요.

  // Todo : Q-2. '강철톤' 이라는 값이 pokeArr 목록에 있는지 조회하고, 몇번째에 있는지 확인하세요.

  // Todo : Q-3. '헤라크로스' 라는 포켓몬스터는 
  /*

  타입이 '벌레', '격투' 라는 속성을 가지고 있습니다.
  분류는 "외뿔포켓몬"으로 분류합니다.
  특성은 "벌레의알림"과 "근성"이 존재합니다.
  숨겨진 특성은 "자기과신"이라고 합니다.

  */

  // Todo : Q-3. pokeArr 목록에서 '헤라크로스'를 찾아 객체로 데이터를 가공하세요.
  