const objOne = {
  name: "떡볶이",
  price: 15000,
  address: "대전",
  taste: ["달다", "맵다"]
};

const objTwo = {
  name: "디저트",
  price: 15000,
  address: "서울",
  taste: ["달다"]
}

// todo : 두개의 객체가 있다.
// todo : 두개의 객체의 값을 비교하는 데이터 처리를 if() 조건문을 통해 제어해본다.

// ? 두 객체의 가격이 같은지 확인하고, 두 객체의 name 프로퍼티 값을 활용해 console에 한문장으로 설명하는 알고리즘을 작성하시오.

// ? 두 객체의 주소값이 같은지 비교하고, 다른 값을 같은 값으로 변환하시오.

// * 이 두개의 문제를 해결했을때 -> 실무에서 쓰는 알고리즘
// * 비밀번호 재설정하기 / 값 비교하기 / 게임케릭터 능력치 만들기 등등 무궁무진
// * 데이터 처리 입문이라고 할 수 있음

// ! 파일이름이 길어서 터미널로 작성하기 불편하니 간단히 복사해서 연구해보세요!
